# GetUpstreamNodeIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalAnalyticalNode..::..GetUpstreamNodeIds Method
ElectricalAnalyticalNode Class See Also
---
Gets upstream node ids.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public IList<ElementId> GetUpstreamNodeIds()
```

Visual Basic
---
```text
Public Function GetUpstreamNodeIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetUpstreamNodeIds()
```

# ### Return Value
The array of upstream node ids.
# Remarks
If node B supplies from node A, node B is the downstream node of node A, and node A is the upstream node of node B. Usually one node only has one upstream node, but TransferSwitch may have two upstream nodes.
# See Also
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace